In [1]:
import pandas as pd

In [2]:
Richest=pd.read_csv("TopRichestInWorld.csv",usecols=["Name","Age"],index_col=["Name"]).squeeze()

In [3]:
Richest

Name
Elon Musk                   50
Jeff Bezos                  58
Bernard Arnault & family    73
Bill Gates                  66
Warren Buffett              91
                            ..
Vladimir Potanin            61
Harold Hamm & family        76
Sun Piaoyang                63
Luo Liguo & family          66
Peter Woo                   75
Name: Age, Length: 101, dtype: int64

In [17]:
Richest.idxmax()

'Lee Shau Kee'

In [7]:
Richest.max()

np.int64(94)

In [6]:
Richest.sort_values(ascending=False)

Name
Lee Shau Kee               94
Li Ka-shing                93
Warren Buffett             91
Rupert Murdoch & family    91
Leonard Lauder             89
                           ..
Guillaume Pousaz           40
Yang Huiyan & family       40
Zhang Yiming               38
Mark Zuckerberg            37
Sam Bankman-Fried          30
Name: Age, Length: 101, dtype: int64

In [19]:
Richest.idxmin()

'Sam Bankman-Fried'

In [8]:
Richest.min()

np.int64(30)

In [11]:
Richest.mean().round(2)

np.float64(67.12)

In [12]:
Richest.to_csv("Sample.csv")

In [16]:
practice=pd.read_csv("Sample.csv",index_col=False)
practice

                         Name  Age
0                   Elon Musk   50
1                  Jeff Bezos   58
2    Bernard Arnault & family   73
3                  Bill Gates   66
4              Warren Buffett   91
..                        ...  ...
96           Vladimir Potanin   61
97       Harold Hamm & family   76
98               Sun Piaoyang   63
99         Luo Liguo & family   66
100                 Peter Woo   75

[101 rows x 2 columns]